## Data Engineering Coding Syntax Solutions:

In [37]:
import pandas as pd
import numpy as np

In [38]:
d = {'name' : ['Andy','Jose','Dieu','Chloe','Jose'],
    'continent' : ['America','Europe','Asia','America','Europe'],
    'college' : ['Lib Arts','Business','Engineering','Engineering','Business'],
    }
df = pd.DataFrame(d)
df

       college continent   name
0     Lib Arts   America   Andy
1     Business    Europe   Jose
2  Engineering      Asia   Dieu
3  Engineering   America  Chloe
4     Business    Europe   Jose

# Question 1

In [39]:
# Remeove duplicate
df = df.drop_duplicates()
#dummies of continent
dummies = pd.get_dummies(df['continent'])
# print(dummies)
df_concat = pd.concat([df['college'], dummies], axis=1)
df_concat.groupby('college').sum()

             America  Asia  Europe
college
Business           0     0       1
Engineering        1     1       0
Lib Arts           1     0       0

# A) Write R or Pandas code to de-dup STUDENTS (1pt):

In [40]:
# Remeove duplicate
df = df.drop_duplicates()

# B) Create a data frame COUNTS storing the count of students for each continent, college pair (2pts):

In [41]:
df = df.groupby(['continent','college']).count().reset_index()
df

  continent      college  name
0   America  Engineering     1
1   America     Lib Arts     1
2      Asia  Engineering     1
3    Europe     Business     1

# C) Pivot COUNTS so that continent values become column names (2pts

In [42]:
#Q 1 C answer

PIVOTS=pd.pivot_table(df, values = 'name', index=['college'], columns = 'continent')
PIVOTS

continent    America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

# D) If applicable, remove any unnecessary index levels created in part C (1pts):

NA

# E) Zero-fill missing values in COUNTS (1pt):

In [43]:
zero_fill = PIVOTS.fillna(0)
zero_fill

continent    America  Asia  Europe
college
Business         0.0   0.0     1.0
Engineering      1.0   1.0     0.0
Lib Arts         1.0   0.0     0.0

# F) Sort COUNTS reverse alphabetically by college name (1pt):

In [44]:
df = df.sort_values(['college'],ascending=False)
df

  continent      college  name
1   America     Lib Arts     1
0   America  Engineering     1
2      Asia  Engineering     1
3    Europe     Business     1

# Question 2

# A)	Select the answer to complete the assigned task (2pts)

### Ans: A) (df.loc[[‘apr’, ‘may’, ‘jun’],][‘eggs’] > 100).sum()

# B)	Complete the script to produce the output shown (2pts)

### Ans: A) strptime, .date()

# C) Select the correct script to accomplish the task (2pts)

### Ans: B)	iris.loc[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, ascending = False)